window.onload = function () {
    // =================================================================================================

    // 1) Напишіть функцію яка рахує кількість букв великого регістру в стрінгу і повертає кількість
    // CountLowrercase("abc"); ===> 0

    // CountLowrercase("abcABC123"); ===> 3

    // CountLowrercase("abcABC123!@€£#$%^&*()_-+=}{[]|\':;?/>.<,~"); ===> 3
    let CountLowrercase = function (str) {
        let matches = str.match(/[A-Z]/g);
        //   return matches ? matches.length : 0;

        if (matches) {
            console.log(matches.length);
        } else {
            console.log(0);
        }
    }

    CountLowrercase("abcABC123!@€£#$%^&*()_-+=}{[]|\':;?/>.<,~");
    CountLowrercase("abcABC123");
    CountLowrercase("abc");

    // ===================================================================================================


    // 2) Написати функцію яка видаляє всі тексктові символи з стрінга, а отриманні цифрові значення переводить в тип намбер та повертає його 


    const fclearString = function (s) {
        const num = s.match(/[0-9]/g);
        console.log(num.join(''));
    }

    fclearString("hell5o wor6ld");


    // ======================================================================================================

    // 3) Створити інпут який отримує пін код ( це 4 цифрових значення). За допомогою регулярки перевітити чи валідний пін код ввів користувач
    // "1234"   -->  true
    // "12345"  -->  false
    // "a234"   -->  false

    // const body = document.querySelector('body');
    // const inp = document.createElement('')


    // =======================================================================================================
    // 4) Створити регулярку яка отримує адресс сторінки і повертає тільки адресс  
    // "https://prog.academy/?page=1" -->"https://prog.academy/"

    const returnAdresss = function(linc){
        const checkAdress = linc.math()
    }

    // ===========================================================================================================
    // 5) Створити функцію валідації юзернейма, імя може включати літери цифри, тире і нижьнє тире, довжина імя повина бути від 4 до 10 символів. Приклад: validateUsr('a') => false,
    // validateUsr('p1pp1') => true, validateUsr('asd43_34') => true





}